; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_11)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - person
	)

  (:init
		(= (x b0) -9)
(= (y b0) 0)
(= (x b1) -9)
(= (y b1) 0)
(= (x b2) -8)
(= (y b2) 0)
(= (x b3) -7)
(= (y b3) 0)
(= (x b4) 3)
(= (y b4) 0)
(= (x b5) 10)
(= (y b5) 0)
(= (x b6) -8)
(= (y b6) 0)
(= (x b7) 0)
(= (y b7) 0)
(= (x b8) -6)
(= (y b8) 0)
(= (x b9) -7)
(= (y b9) 0)
(= (x b10) -3)
(= (y b10) 0)
(= (x b11) 0)
(= (y b11) 0)
(= (x b12) -4)
(= (y b12) 0)
(= (x b13) 0)
(= (y b13) 0)
(= (x b14) -3)
(= (y b14) 0)

		(= (d p0) 42)
(= (d p1) 5)
(= (d p2) 83)
(= (d p3) 84)
(= (d p4) 28)
(= (d p5) 25)
(= (d p6) 54)
(= (d p7) 79)
(= (d p8) 93)
(= (d p9) 15)
(= (d p10) 15)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
		)
	)
)

; plan
1. (go_est b13)
   changed: (x b13) from 0 to 3
   goals met: 0 of 11
2. (go_est b7)
   changed: (x b7) from 0 to 3
   goals met: 0 of 11
3. (go_north_east b11)
   changed: (x b11) from 0 to 1.5, (y b11) from 0 to 1.5
   goals met: 0 of 11
4. (go_north_east b11)
   changed: (x b11) from 1.5 to 3, (y b11) from 1.5 to 3
   goals met: 0 of 11
5. (go_north_east b11)
   changed: (x b11) from 3 to 4.5, (y b11) from 3 to 4.5
   goals met: 0 of 11
6. (go_north_east b11)
   changed: (x b11) from 4.5 to 6, (y b11) from 4.5 to 6
   goals met: 0 of 11
7. (go_north_east b11)
   changed: (x b11) from 6 to 7.5, (y b11) from 6 to 7.5
   goals met: 0 of 11
8. (go_north_east b11)
   changed: (x b11) from 7.5 to 9, (y b11) from 7.5 to 9
   goals met: 0 of 11
9. (go_north_east b11)
   changed: (x b11) from 9 to 10.5, (y b11) from 9 to 10.5
   goals met: 0 of 11
10. (go_north_east b11)
   changed: (x b11) from 10.5 to 12, (y b11) from 10.5 to 12
   goals met: 0 of 11
11. (go_north_east b11)
   changed: (x b11) from 12 to 13.5, (y b11) from 12 to 13.5
   goals met: 0 of 11
12. (go_north_east b11)
   changed: (x b11) from 13.5 to 15, (y b11) from 13.5 to 15
   goals met: 0 of 11
13. (go_north_west b11)
   changed: (x b11) from 15 to 13.5, (y b11) from 15 to 16.5
   goals met: 0 of 11
14. (go_north_west b11)
   changed: (x b11) from 13.5 to 12, (y b11) from 16.5 to 18
   goals met: 0 of 11
15. (save_person b11 p1)
   added: (saved p1)
   goals met: 1 of 11
16. (go_north_east b11)
   changed: (x b11) from 12 to 13.5, (y b11) from 18 to 19.5
   goals met: 1 of 11
17. (go_north_east b11)
   changed: (x b11) from 13.5 to 15, (y b11) from 19.5 to 21
   goals met: 1 of 11
18. (go_north_east b11)
   changed: (x b11) from 15 to 16.5, (y b11) from 21 to 22.5
   goals met: 1 of 11
19. (go_north_east b11)
   changed: (x b11) from 16.5 to 18, (y b11) from 22.5 to 24
   goals met: 1 of 11
20. (go_west b11)
   changed: (x b11) from 18 to 15
   goals met: 1 of 11
21. (go_north_west b11)
   changed: (x b11) from 15 to 13.5, (y b11) from 24 to 25.5
   goals met: 1 of 11
22. (go_north_west b11)
   changed: (x b11) from 13.5 to 12, (y b11) from 25.5 to 27
   goals met: 1 of 11
23. (save_person b11 p9)
   added: (saved p9)
   goals met: 2 of 11
24. (save_person b11 p10)
   added: (saved p10)
   goals met: 3 of 11
25. (go_north_east b11)
   changed: (x b11) from 12 to 13.5, (y b11) from 27 to 28.5
   goals met: 3 of 11
26. (go_north_east b11)
   changed: (x b11) from 13.5 to 15, (y b11) from 28.5 to 30
   goals met: 3 of 11
27. (go_north_east b11)
   changed: (x b11) from 15 to 16.5, (y b11) from 30 to 31.5
   goals met: 3 of 11
28. (go_north_east b11)
   changed: (x b11) from 16.5 to 18, (y b11) from 31.5 to 33
   goals met: 3 of 11
29. (go_north_east b11)
   changed: (x b11) from 18 to 19.5, (y b11) from 33 to 34.5
   goals met: 3 of 11
30. (go_north_east b11)
   changed: (x b11) from 19.5 to 21, (y b11) from 34.5 to 36
   goals met: 3 of 11
31. (go_north_east b11)
   changed: (x b11) from 21 to 22.5, (y b11) from 36 to 37.5
   goals met: 3 of 11
32. (go_north_east b11)
   changed: (x b11) from 22.5 to 24, (y b11) from 37.5 to 39
   goals met: 3 of 11
33. (go_north_east b11)
   changed: (x b11) from 24 to 25.5, (y b11) from 39 to 40.5
   goals met: 3 of 11
34. (go_north_east b11)
   changed: (x b11) from 25.5 to 27, (y b11) from 40.5 to 42
   goals met: 3 of 11
35. (go_north_east b11)
   changed: (x b11) from 27 to 28.5, (y b11) from 42 to 43.5
   goals met: 3 of 11
36. (go_north_east b11)
   changed: (x b11) from 28.5 to 30, (y b11) from 43.5 to 45
   goals met: 3 of 11
37. (go_north_east b11)
   changed: (x b11) from 30 to 31.5, (y b11) from 45 to 46.5
   goals met: 3 of 11
38. (go_north_east b11)
   changed: (x b11) from 31.5 to 33, (y b11) from 46.5 to 48
   goals met: 3 of 11
39. (go_west b11)
   changed: (x b11) from 33 to 30
   goals met: 3 of 11
40. (go_west b11)
   changed: (x b11) from 30 to 27
   goals met: 3 of 11
41. (go_west b11)
   changed: (x b11) from 27 to 24
   goals met: 3 of 11
42. (go_west b11)
   changed: (x b11) from 24 to 21
   goals met: 3 of 11
43. (go_west b11)
   changed: (x b11) from 21 to 18
   goals met: 3 of 11
44. (go_west b11)
   changed: (x b11) from 18 to 15
   goals met: 3 of 11
45. (go_west b11)
   changed: (x b11) from 15 to 12
   goals met: 3 of 11
46. (go_west b11)
   changed: (x b11) from 12 to 9
   goals met: 3 of 11
47. (go_west b11)
   changed: (x b11) from 9 to 6
   goals met: 3 of 11
48. (go_north_east b11)
   changed: (x b11) from 6 to 7.5, (y b11) from 48 to 49.5
   goals met: 3 of 11
49. (go_north_east b11)
   changed: (x b11) from 7.5 to 9, (y b11) from 49.5 to 51
   goals met: 3 of 11
50. (go_north_east b11)
   changed: (x b11) from 9 to 10.5, (y b11) from 51 to 52.5
   goals met: 3 of 11
51. (go_north_east b11)
   changed: (x b11) from 10.5 to 12, (y b11) from 52.5 to 54
   goals met: 3 of 11
52. (go_north_east b11)
   changed: (x b11) from 12 to 13.5, (y b11) from 54 to 55.5
   goals met: 3 of 11
53. (go_north_east b11)
   changed: (x b11) from 13.5 to 15, (y b11) from 55.5 to 57
   goals met: 3 of 11
54. (go_north_east b11)
   changed: (x b11) from 15 to 16.5, (y b11) from 57 to 58.5
   goals met: 3 of 11
55. (go_north_east b11)
   changed: (x b11) from 16.5 to 18, (y b11) from 58.5 to 60
   goals met: 3 of 11
56. (go_north_east b11)
   changed: (x b11) from 18 to 19.5, (y b11) from 60 to 61.5
   goals met: 3 of 11
57. (go_west b11)
   changed: (x b11) from 19.5 to 16.5
   goals met: 3 of 11
58. (go_west b11)
   changed: (x b11) from 16.5 to 13.5
   goals met: 3 of 11
59. (go_west b11)
   changed: (x b11) from 13.5 to 10.5
   goals met: 3 of 11
60. (go_west b11)
   changed: (x b11) from 10.5 to 7.5
   goals met: 3 of 11
61. (save_person b11 p6)
   added: (saved p6)
   goals met: 4 of 11
62. (go_north_east b11)
   changed: (x b11) from 7.5 to 9, (y b11) from 61.5 to 63
   goals met: 4 of 11
63. (go_north_east b11)
   changed: (x b11) from 9 to 10.5, (y b11) from 63 to 64.5
   goals met: 4 of 11
64. (go_north_east b11)
   changed: (x b11) from 10.5 to 12, (y b11) from 64.5 to 66
   goals met: 4 of 11
65. (go_north_east b11)
   changed: (x b11) from 12 to 13.5, (y b11) from 66 to 67.5
   goals met: 4 of 11
66. (go_west b11)
   changed: (x b11) from 13.5 to 10.5
   goals met: 4 of 11
67. (go_west b11)
   changed: (x b11) from 10.5 to 7.5
   goals met: 4 of 11
68. (go_west b11)
   changed: (x b11) from 7.5 to 4.5
   goals met: 4 of 11
69. (go_west b11)
   changed: (x b11) from 4.5 to 1.5
   goals met: 4 of 11
70. (go_west b11)
   changed: (x b11) from 1.5 to -1.5
   goals met: 4 of 11
71. (go_west b11)
   changed: (x b11) from -1.5 to -4.5
   goals met: 4 of 11
72. (go_west b11)
   changed: (x b11) from -4.5 to -7.5
   goals met: 4 of 11
73. (go_west b11)
   changed: (x b11) from -7.5 to -10.5
   goals met: 4 of 11
74. (go_west b11)
   changed: (x b11) from -10.5 to -13.5
   goals met: 4 of 11
75. (go_north_east b11)
   changed: (x b11) from -13.5 to -12, (y b11) from 67.5 to 69
   goals met: 4 of 11
76. (go_north_east b11)
   changed: (x b11) from -12 to -10.5, (y b11) from 69 to 70.5
   goals met: 4 of 11
77. (go_north_east b11)
   changed: (x b11) from -10.5 to -9, (y b11) from 70.5 to 72
   goals met: 4 of 11
78. (go_north_east b11)
   changed: (x b11) from -9 to -7.5, (y b11) from 72 to 73.5
   goals met: 4 of 11
79. (go_north_east b11)
   changed: (x b11) from -7.5 to -6, (y b11) from 73.5 to 75
   goals met: 4 of 11
80. (go_north_east b11)
   changed: (x b11) from -6 to -4.5, (y b11) from 75 to 76.5
   goals met: 4 of 11
81. (go_north_east b11)
   changed: (x b11) from -4.5 to -3, (y b11) from 76.5 to 78
   goals met: 4 of 11
82. (go_north_east b11)
   changed: (x b11) from -3 to -1.5, (y b11) from 78 to 79.5
   goals met: 4 of 11
83. (go_north_east b11)
   changed: (x b11) from -1.5 to 0, (y b11) from 79.5 to 81
   goals met: 4 of 11
84. (save_person b11 p7)
   added: (saved p7)
   goals met: 5 of 11
85. (go_north_east b11)
   changed: (x b11) from 0 to 1.5, (y b11) from 81 to 82.5
   goals met: 5 of 11
86. (go_north_west b11)
   changed: (x b11) from 1.5 to 0, (y b11) from 82.5 to 84
   goals met: 5 of 11
87. (save_person b11 p2)
   added: (saved p2)
   goals met: 6 of 11
88. (save_person b11 p3)
   added: (saved p3)
   goals met: 7 of 11
89. (go_south b11)
   changed: (y b11) from 84 to 82
   goals met: 7 of 11
90. (go_south_west b11)
   changed: (x b11) from 0 to 2, (y b11) from 82 to 80
   goals met: 7 of 11
91. (go_south_west b11)
   changed: (x b11) from 2 to 4, (y b11) from 80 to 78
   goals met: 7 of 11
92. (go_south_west b11)
   changed: (x b11) from 4 to 6, (y b11) from 78 to 76
   goals met: 7 of 11
93. (go_south_west b11)
   changed: (x b11) from 6 to 8, (y b11) from 76 to 74
   goals met: 7 of 11
94. (go_south_east b11)
   changed: (x b11) from 8 to 6, (y b11) from 74 to 72
   goals met: 7 of 11
95. (go_south_east b11)
   changed: (x b11) from 6 to 4, (y b11) from 72 to 70
   goals met: 7 of 11
96. (go_south_east b11)
   changed: (x b11) from 4 to 2, (y b11) from 70 to 68
   goals met: 7 of 11
97. (go_south_east b11)
   changed: (x b11) from 2 to 0, (y b11) from 68 to 66
   goals met: 7 of 11
98. (save_person b11 p0)
   added: (saved p0)
   goals met: 8 of 11
99. (go_north_east b11)
   changed: (x b11) from 0 to 1.5, (y b11) from 66 to 67.5
   goals met: 8 of 11
100. (go_north_east b11)
   changed: (x b11) from 1.5 to 3, (y b11) from 67.5 to 69
   goals met: 8 of 11
101. (go_north_east b11)
   changed: (x b11) from 3 to 4.5, (y b11) from 69 to 70.5
   goals met: 8 of 11
102. (go_north_east b11)
   changed: (x b11) from 4.5 to 6, (y b11) from 70.5 to 72
   goals met: 8 of 11
103. (go_north_west b11)
   changed: (x b11) from 6 to 4.5, (y b11) from 72 to 73.5
   goals met: 8 of 11
104. (go_north_west b11)
   changed: (x b11) from 4.5 to 3, (y b11) from 73.5 to 75
   goals met: 8 of 11
105. (go_north_west b11)
   changed: (x b11) from 3 to 1.5, (y b11) from 75 to 76.5
   goals met: 8 of 11
106. (go_north_west b11)
   changed: (x b11) from 1.5 to 0, (y b11) from 76.5 to 78
   goals met: 8 of 11
107. (go_north_west b11)
   changed: (x b11) from 0 to -1.5, (y b11) from 78 to 79.5
   goals met: 8 of 11
108. (go_north_west b11)
   changed: (x b11) from -1.5 to -3, (y b11) from 79.5 to 81
   goals met: 8 of 11
109. (go_south_east b11)
   changed: (x b11) from -3 to -5, (y b11) from 81 to 79
   goals met: 8 of 11
110. (go_north_east b11)
   changed: (x b11) from -5 to -3.5, (y b11) from 79 to 80.5
   goals met: 8 of 11
111. (go_north_east b11)
   changed: (x b11) from -3.5 to -2, (y b11) from 80.5 to 82
   goals met: 8 of 11
112. (go_north_east b11)
   changed: (x b11) from -2 to -0.5, (y b11) from 82 to 83.5
   goals met: 8 of 11
113. (go_north_east b11)
   changed: (x b11) from -0.5 to 1, (y b11) from 83.5 to 85
   goals met: 8 of 11
114. (go_north_east b11)
   changed: (x b11) from 1 to 2.5, (y b11) from 85 to 86.5
   goals met: 8 of 11
115. (go_north_east b11)
   changed: (x b11) from 2.5 to 4, (y b11) from 86.5 to 88
   goals met: 8 of 11
116. (go_north_east b11)
   changed: (x b11) from 4 to 5.5, (y b11) from 88 to 89.5
   goals met: 8 of 11
117. (go_north_west b4)
   changed: (x b4) from 3 to 1.5, (y b4) from 0 to 1.5
   goals met: 8 of 11
118. (go_north_east b4)
   changed: (x b4) from 1.5 to 3, (y b4) from 1.5 to 3
   goals met: 8 of 11
119. (go_north_east b4)
   changed: (x b4) from 3 to 4.5, (y b4) from 3 to 4.5
   goals met: 8 of 11
120. (go_north_east b4)
   changed: (x b4) from 4.5 to 6, (y b4) from 4.5 to 6
   goals met: 8 of 11
121. (go_north_east b4)
   changed: (x b4) from 6 to 7.5, (y b4) from 6 to 7.5
   goals met: 8 of 11
122. (go_north_east b4)
   changed: (x b4) from 7.5 to 9, (y b4) from 7.5 to 9
   goals met: 8 of 11
123. (go_north_east b4)
   changed: (x b4) from 9 to 10.5, (y b4) from 9 to 10.5
   goals met: 8 of 11
124. (go_north_east b4)
   changed: (x b4) from 10.5 to 12, (y b4) from 10.5 to 12
   goals met: 8 of 11
125. (go_north_east b4)
   changed: (x b4) from 12 to 13.5, (y b4) from 12 to 13.5
   goals met: 8 of 11
126. (go_north_west b4)
   changed: (x b4) from 13.5 to 12, (y b4) from 13.5 to 15
   goals met: 8 of 11
127. (go_north_west b4)
   changed: (x b4) from 12 to 10.5, (y b4) from 15 to 16.5
   goals met: 8 of 11
128. (go_north_west b4)
   changed: (x b4) from 10.5 to 9, (y b4) from 16.5 to 18
   goals met: 8 of 11
129. (go_north_west b4)
   changed: (x b4) from 9 to 7.5, (y b4) from 18 to 19.5
   goals met: 8 of 11
130. (go_north_west b4)
   changed: (x b4) from 7.5 to 6, (y b4) from 19.5 to 21
   goals met: 8 of 11
131. (go_north_west b4)
   changed: (x b4) from 6 to 4.5, (y b4) from 21 to 22.5
   goals met: 8 of 11
132. (go_north_west b4)
   changed: (x b4) from 4.5 to 3, (y b4) from 22.5 to 24
   goals met: 8 of 11
133. (go_north_west b4)
   changed: (x b4) from 3 to 1.5, (y b4) from 24 to 25.5
   goals met: 8 of 11
134. (go_north_west b4)
   changed: (x b4) from 1.5 to 0, (y b4) from 25.5 to 27
   goals met: 8 of 11
135. (save_person b4 p5)
   added: (saved p5)
   goals met: 9 of 11
136. (go_north_west b4)
   changed: (x b4) from 0 to -1.5, (y b4) from 27 to 28.5
   goals met: 9 of 11
137. (go_north_east b4)
   changed: (x b4) from -1.5 to 0, (y b4) from 28.5 to 30
   goals met: 9 of 11
138. (save_person b4 p4)
   added: (saved p4)
   goals met: 10 of 11
139. (go_north_west b11)
   changed: (x b11) from 5.5 to 4, (y b11) from 89.5 to 91
   goals met: 10 of 11
140. (go_north_west b11)
   changed: (x b11) from 4 to 2.5, (y b11) from 91 to 92.5
   goals met: 10 of 11
141. (go_north_west b11)
   changed: (x b11) from 2.5 to 1, (y b11) from 92.5 to 94
   goals met: 10 of 11
142. (save_person b11 p8)
   added: (saved p8)
   goals met: 11 of 11
